Tekla Open API Reference for Tekla Structures 2025
PolyLine.Points Property
 The points the polyline consists of.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Points { get; set; }
Public Property Points As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace